-- Цены на тюнинг
local tuningPrices = {
	-- Покраска кузова
	body_color = {0, 1},
	-- Покраска дисков
	wheels_color = {0, 1},
	-- Покраска спойлера
	spoiler_color = {0, 1},
	-- Спойлеры
	spoilers = {
		{0, 1}, 
		{0, 1}, 
		{0, 1}, 
		{0, 1}, 
		{0, 1}, 
		{0, 1}, 
		{0, 1}, 
		{0, 1}, 
		{0, 1}, 
		{0, 1}, 
		{0, 1}, 
		{0, 1}, 
		{0, 1}, 
		{0, 1}, 
		{0, 1}, 
		{0, 1}, 
		{0, 1}, 
		{0, 1}, 
		{0, 1}, 
		{0, 1}
	},
	-- Колёса
	wheels = {
		{0, 1},
		{0, 1},
		{0, 1},
		{0, 1},
		{0, 1},
		{0, 1},
		{0, 1},
		{0, 1},
		{0, 1},
		{0, 1},
		{0, 1},
		{0, 1},
		{0, 1},
		{0, 1},
		{0, 1},
		{0, 1},
		{0, 1}
	}
}

function getTuningPrices(name)
	if name then
		return tuningPrices[name]
	end
end