-- Координата маркера гаража
-- Координата спавна
-- Координата входа
-- Координата выхода
-- Интерьер 

-- Владелец
-- Цена

housesList = {
	{
		price = 1000000, 
		data = { 
			-- Вход
			enter = {2495.344, -1690.605, 14.3},
			enter_rotation = 0,
			-- Выход
			exit = {2496.0500, -1693.9260, 1014.5},
			exit_rotation = 0,
			-- Маркер гаража
			garage = {2505.365, -1687.128, 13.1},
			garage_rotation = 0,
			-- Точка спавна
			spawn = {2496.0500, -1693.9260, 1013.842},
			spawn_rotation = 0,

			interior = 3,
		}
	},
	{
		price = 1000000, 
		data = { 
			enter = {2522.486, -1679.198, 15},
			enter_rotation = 90,
			exit = {225.756, 1240.000, 1082.1},
			exit_rotation = 90,
			garage = {2511.715, -1671.032, 13.1},
			garage_rotation = 0,
			spawn = {224.080, 1250.974, 1082.148},
			spawn_rotation = 90,
			interior = 2,
		}
	},	
}