-- Координата маркера гаража
-- Координата спавна
-- Координата входа
-- Координата выхода
-- Интерьер 

-- Владелец
-- Цена

housesList = {
	{
		price = 1000000, 
		data = { 
			interior = 3,
			enter = {2495.344, -1690.605, 13.8},
			exit = {2496.0500, -1693.9260, 1013.842},
			garage = {2505.365, -1687.128, 12.6},
			spawn = {2496.0500, -1693.9260, 1013.842}
		}
	},
	{
		price = 100000, 
		data = { 
			interior = 2,
			enter = {2522.486, -1679.198, 14.5},
			exit = {225.756, 1240.000, 1081.149},
			garage = {2511.715, -1671.032, 12.6},
			spawn = {224.080, 1250.974, 1082.148}
		}
	},	
}