-- Координата маркера гаража
-- Координата спавна
-- Координата входа
-- Координата выхода
-- Интерьер 

-- Владелец
-- Цена

housesList = {
    {
        price = 150,
        data = {
            interior = 2,
            enter = {1766.5975341797,-1397.2803955078,15.7578125},
            enter_rotation =  0,
            garage = {1773.8560791016,-1390.2020263672,15.7578125},
            garage_rotation = 270
        }   
    },
    {
        price = 250,
        data = {
            interior = 3,
            enter = {1859.7387695313,-1354.6580810547,13.549164772034},
            enter_rotation = 91,
            garage = {1852.1823730469,-1354.9884033203,13.391132354736},
            garage_rotation = 1
        }   
    },    
}